Revit 2026 API

# FailureMessageKey Methods

---

The FailureMessageKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the integer value of the id as hash code (Overrides ObjectGetHashCode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Checks it this key is equal to the other. |
|  | IsValid | Checks if the failure message key is valid |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FailureMessageKey Class

Autodesk.Revit.DB Namespace